brew "bash"
brew "fastfetch"
brew "git"
brew "git-gui"
brew "kubernetes-cli"
brew "mas"
brew "mole"
brew "starship"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "visual-studio-code"
cask "spotify"
cask "google-chrome"
cask "brave-browser"
cask "appcleaner"
cask "hiddenbar"
cask "chatpgt"
mas "Brother iPrint&Scan", id: 1193539993
mas "CapCut", id: 1500855883
mas "CleanMyKeyboard", id: 6468120888
mas "Hidden Bar", id: 1452453066
mas "Mi papel tapiz", id: 1552826194
mas "The Unarchiver", id: 425424353
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "WhatsApp", id: 310633997
mas "WidgetWall", id: 1618466427
mas "Xcode", id: 497799835