############################################
# Homebrew taps
############################################

tap "homebrew/cask-fonts"
tap "homebrew/services"

############################################
# Core CLI Tools
############################################

brew "bash"
brew "git"
brew "stow"
brew "tree"

############################################
# DevOps CLI Tools
############################################

brew "gh"              # GitHub CLI
brew "kubernetes-cli"  # kubectl                  [work]
brew "k9s"             # Kubernetes terminal UI   [work]
brew "jq"              # JSON processor
brew "ripgrep"         # fast search tool (rg)

############################################
# Terminal Productivity Tools
############################################

brew "starship"        # modern shell prompt
brew "fzf"             # fuzzy finder
brew "zoxide"          # smarter cd
brew "bat"             # better cat
brew "eza"             # better ls
brew "fastfetch"       # system info
brew "mole"            # SSH tunneling helper     [work]
brew "dockutil"        # automate macOS Dock

############################################
# macOS App Store CLI
############################################

brew "mas"

############################################
# Fonts
############################################

cask "font-jetbrains-mono-nerd-font"

############################################
# Development Applications
############################################

cask "visual-studio-code"
cask "docker-desktop"                          # [work]
cask "linear"                                  # [work]
cask "claude"

############################################
# Browsers
############################################

cask "google-chrome"
cask "brave-browser"

############################################
# Terminal
############################################

cask "ghostty"

############################################
# Utilities
############################################

cask "appcleaner"                              # [personal]
cask "rectangle"

############################################
# Media                                    [personal]
############################################

cask "spotify"
cask "vlc"

############################################
# VPN
############################################

cask "surfshark"

############################################
# Mac App Store Applications
############################################

mas "Xcode", id: 497799835
mas "WhatsApp", id: 310633997                  # [personal]
mas "The Unarchiver", id: 425424353
mas "Hidden Bar", id: 1452453066
mas "CapCut", id: 1500855883                   # [personal]
mas "WidgetWall", id: 1618466427
mas "CleanMyKeyboard", id: 6468120888
mas "Brother iPrint&Scan", id: 1193539993
# mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
# mas "Mi papel tapiz", id: 1552826194
