############################################
# Core CLI Tools
############################################

brew "bash"
brew "git"
brew "git-gui"
brew "stow"
brew "tree"

############################################
# DevOps CLI Tools
############################################

brew "gh"              # GitHub CLI
brew "kubernetes-cli"  # kubectl
brew "k9s"             # Kubernetes terminal UI
brew "jq"              # JSON processor
brew "ripgrep"         # fast search tool (rg)

############################################
# Terminal Productivity Tools
############################################

brew "starship"        # modern shell prompt
brew "fzf"             # fuzzy finder
brew "zoxide"          # smarter cd
brew "bat"             # better cat
brew "eza"             # better ls
brew "fastfetch"       # system info
brew "mole"            # SSH tunneling helper

############################################
# macOS App Store CLI
############################################

brew "mas"

############################################
# Terminal / Fonts
############################################

cask "font-jetbrains-mono-nerd-font"

############################################
# Development Applications
############################################

cask "visual-studio-code"
cask "docker-desktop"

############################################
# Browsers
############################################

cask "google-chrome"
cask "brave-browser"

############################################
# Terminal
############################################

cask "ghostty"

############################################
# Utilities
############################################

cask "appcleaner"
cask "rectangle"

############################################
# Media
############################################

cask "spotify"
cask "vlc"

############################################
# Mac App Store Applications
############################################

mas "Xcode", id: 497799835
mas "WhatsApp", id: 310633997
mas "The Unarchiver", id: 425424353
mas "Hidden Bar", id: 1452453066
mas "CapCut", id: 1500855883
mas "WidgetWall", id: 1618466427
mas "CleanMyKeyboard", id: 6468120888
mas "Brother iPrint&Scan", id: 1193539993
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Mi papel tapiz", id: 1552826194