############################################
# Homebrew taps
############################################

tap "homebrew/cask-fonts"
tap "homebrew/services"

############################################
# Core CLI Tools
############################################

brew "bash"
brew "git"
brew "stow"
brew "tree"

############################################
# DevOps CLI Tools
############################################

brew "gh"              # GitHub CLI
brew "kubernetes-cli"  # kubectl
brew "k9s"             # Kubernetes terminal UI
brew "jq"              # JSON processor
brew "ripgrep"         # fast search tool (rg)

############################################
# Terminal Productivity Tools
############################################

brew "starship"        # modern shell prompt
brew "fzf"             # fuzzy finder
brew "zoxide"          # smarter cd
brew "bat"             # better cat
brew "eza"             # better ls
brew "fastfetch"       # system info
brew "mole"            # SSH tunneling helper
brew "dockutil"        # automate macOS Dock

############################################
# macOS App Store CLI
############################################

brew "mas"

############################################
# Fonts
############################################

cask "font-jetbrains-mono-nerd-font"

############################################
# Development Applications
############################################

cask "visual-studio-code"
cask "docker-desktop"
cask "linear"
cask "claude"

############################################
# Browsers
############################################

cask "google-chrome"
cask "brave-browser"

############################################
# Terminal
############################################

cask "ghostty"

############################################
# Utilities
############################################

cask "rectangle"

############################################
# VPN
############################################

cask "surfshark"

############################################
# Mac App Store Applications
############################################

mas "Xcode", id: 497799835
mas "The Unarchiver", id: 425424353
mas "Hidden Bar", id: 1452453066
mas "WidgetWall", id: 1618466427
mas "CleanMyKeyboard", id: 6468120888
mas "Brother iPrint&Scan", id: 1193539993
